{
  "headline": "The VASSAL Team is happy to announce VASSAL {{version}}, which is a preview release.",
  "important": [
    "NEW! 64-bit ARM packages: There are now MacOS and Windows pacakges for 64-bit ARM processors. If you have a Mac with an Apple Silicon CPU (which is a 64-bit ARM processor), we recommend using the 64-bit ARM build.",
    "Code deprecated more than a year ago has been removed. Modules using that code MUST be updated if they are to work with {{version_feature}}.",
    "Things may be broken which worked previously. If you find a new bug, please report it.",
    "Modules saved in {{version_feature}} are not openable by earlier versions of VASSAL. We recommend keeping a backup copy of any pre-{{version_feature}} modules you plan to modify in {{version_feature}} until you've verified that everything works to your satisfaction."
  ],
  "downloads": [
    { "display_name": "Linux", "suffix": "linux.tar.bz2" },
    { "display_name": "MacOS (64-bit ARM)", "suffix": "macos-aarch64.dmg" },
    { "display_name": "MacOS (64-bit x86)", "suffix": "macos-x86_64.dmg" },
    { "display_name": "Windows (64-bit ARM)", "suffix": "windows-aarch64.exe" },
    { "display_name": "Windows (64-bit x86)", "suffix": "windows-x86_64.exe" },
    { "display_name": "Windows (32-bit x86)", "suffix": "windows-x86_32.exe" },
    { "display_name": "Other", "suffix": "other.zip" }
  ],
  "changes": [
    {
      "in": "3.6.0-beta6",
      "since": "3.6.0-beta5",
      "new_features": [
        { "num": 9391, "desc": "Beanshell can now access $$ variables in Report Formats" }
      ],
      "bug_fixes": [
        { "num": 10635, "desc": "Trigger Action traits with \"loop until\" and \"loop while\" conditions can properly access piece properties in expression builder" },
        { "num": 10632, "desc": "Fix ArrayIndexOutOfBoundsException in Embellishment when layer value is out of range" },
        { "num": 10631, "desc": "Clip pieces to their bounds and set rendering hints for drag image" },
        { "num": 10630, "desc": "Correctly check if there are sides with blank passwords for password matching" },
        { "num": 10629, "desc": "String Array Configurer bounds protection" },
        { "num": 10623, "desc": "Fix NPE joining chat room when socket drops early" },
        { "num": 10622, "desc": "Fix NPE when MapShader temporarily points to blank or missing filename"},
        { "num": 10621, "desc": "Protect against changing to Image style while Image name is still blank" },
        { "num": 10619, "desc": "Eliminate Command+A key conflict in Editor on MacOS" },
        { "num": 10618, "desc": "ToolbarMenus that are submenus of other ToolbarMenus display their icons properly" }
      ],
      "other_improvements": [
        { "num": 10626, "desc": "Different types of Global Key Commands can be cut and pasted" },
        { "num": 10610, "desc": "More robust configurer for PredefinedSetup" },
        { "num": 10609, "desc": "Trigger Action - improved trait summary" },
        { "num": 9596, "desc": "Pieces dragged off the palette using the palette scale factor instead of always full size" }
      ]
    },
    {
      "in": "3.6.0-beta5",
      "since": "3.6.0-beta4",
      "new_features": [
      ],
      "bug_fixes": [
        { "num": 10640, "desc": "Tidier right arrow symbol in default move reports" },
        { "num": 10620, "desc": "Fix NPE EditPropertiesAction.windowClosed()" },
        { "num": 10616, "desc": "Mouseover Stack Viewer was failing to launch in certain situations" },
        { "num": 10615, "desc": "Stack NPE in Mat Movement code" }
      ],
      "other_improvements": [
      ]
    },
    {
      "in": "3.6.0-beta4",
      "since": "3.6.0-beta3",
      "new_features": [
        { "num": 10584, "desc": "Map \"Mark Unmoved\" button now accepts a hotkey and a report format" },
        { "num": 10582, "desc": "Basic Name trait - facilitates creating pieces entirely in prototype (alternative way to fill BasicName property)" },
        { "num": 10576, "desc": "Send-to-Location new options for pieces-selected-by-properties: cycle and nearest" },
        { "num": 10558, "desc": "Added Current Mat GKC FastMatch option" },
        { "num": 10552, "desc": "CounterDetailViewer - can combine layer filters with property match expression" },
        { "num": 10551, "desc": "Action Button option to open right-click context menu" },
        { "num": 10509, "desc": "Add $numericTotal$ and $result#$ options to standard Dice Button report format" },
        { "num": 10505, "desc": "Enable Offset options to work with the Grid option in SendToLocation" }
      ],
      "bug_fixes": [
        { "num": 10607, "desc": "P2P address book entries with spaces in address cause StringIndexOutOfBoundsException" },
        { "num": 10604, "desc": "Match blank passwords less eagerly" },
        { "num": 10603, "desc": "Action Buttons should not respond to Shift+Click, Ctrl+Click, Alt+Click, Cmd+Click" },
        { "num": 10602, "desc": "Don't unselect piece about to get context menu with Ctrl+RightClick" },
        { "num": 10601, "desc": "Flares weren't responding to Cmd key on MacOS" },
        { "num": 10599, "desc": "map can be null during GameRefresher" },
        { "num": 10596, "desc": "Protect CounterDetailViewer from designers who set the drawing scale to 0.0" },
        { "num": 10595, "desc": "Fix crash ending logfiles- beginningState shouldn't be allowed to be non-null when outputfile is null" },
        { "num": 10594, "desc": "Fix crash when copying Toolbar Menu to a newly created map" },
        { "num": 10592, "desc": "Corner case boardpicker exception with multiple boards being moved around" },
        { "num": 10591, "desc": "Protect from GKCs that get sent when no game ever started" },
        { "num": 10589, "desc": "Fix Mat send-to-location bug (which created problems in Undo & multiplayer)" },
        { "num": 10585, "desc": "Movement Trail \"initial visibility\" and bounding box caching bugs" },
        { "num": 10572, "desc": " Fix Drag Threshold preference to work correctly" },
        { "num": 10563, "desc": "Trait editor Paste button is now always enabled" },
        { "num": 10555, "desc": "Fix mat save/load to reconnect mats and cargo" },
        { "num": 10504, "desc": "Text label shape, bounding box doesn't resepect rotated labels" },
        { "num": 8949, "desc": "IllegalArgumentException in GameState.getRestorePiecesCommand() due to bad compartor" }
      ],
      "other_improvements": [
        { "num": 10597, "desc": "Selection Highlighter expressions now found by search" },
        { "num": 10593, "desc": "Add description to Prototype Definition" },
        { "num": 10590, "desc": "Better ConfigureTree summary on PieceSlot containing a BasicName-using piece" },
        { "num": 10587, "desc": "Description field & better auto-summary for Does Not Stack" },
        { "num": 10586, "desc": "Better defaults for Send To Location offsets" },
        { "num": 10578, "desc": "MatCargo now provides OldMatOffsetX and OldMatOffsetY properties" },
        { "num": 10569, "desc": "Better trait one-line summaries in editor; Folder summary includes description" },
        { "num": 10565, "desc": "While double-clicking to open component in Editor, holding Alt, Shift, and/or Ctrl affects the location the new window opens" },
        { "num": 10557, "desc": " Added MatCargo to manually attach/detach from mats" },
        { "num": 10547, "desc": "Bring fastmatch $$ variable handling into line with standard Global Key Command match expression handling" },
        { "num": 10543, "desc": "Initialise OldMat related properties in a Placed marker" },
        { "num": 10519, "desc": "Improve Mat Movement" },
        { "num": 10510, "desc": "More robust Java version check for Linux" }
      ]
    },
    {
      "in": "3.6.0-beta3",
      "since": "3.6.0-beta2",
      "new_features": [
        { "num": 10486, "desc": "Better obscurable option for insetting" },
        { "num": 10484, "desc": "Mats have more deselection options; double-clicking delesects cargo" },
        { "num": 10468, "desc": "Refresh Counters support for Mats and Cargo" },
        { "num": 10454, "desc": "Game Piece Palette allows setting of default width for \"docked\" Game Piece Palette" },
        { "num": 10412, "desc": "Double the max heap for modules which run out of memory during loading" },
        { "num": 10394, "desc": "Add a Key Command to Can Rotate trait to rotate directly to a facing specified by an expression" }
      ],
      "bug_fixes": [
        { "num": 10476, "desc": "Editor: Inserting text into middle of Key Command doesn't work" },
        { "num": 10474, "desc": "Movement traits need to update cargo's mat after movement before applying apply-on-move keystroke" },
        { "num": 10405, "desc": "Log replay of delete command behaves differently after load of sebsequent log file" },
        { "num": 10402, "desc": "NPE when trying to create new P2P Network" },
        { "num": 10400, "desc": "Custom preferences in Global Options incorrectly use property name, not description" },
        { "num": 10404, "desc": "Catch FileNotFoundException when reading prefs files" },
        { "num": 10399, "desc": "ThrowableUtils.throwAncestor() throws wrong object; throwMe() uses wrong constructor" }
      ],
      "other_improvements": [
         { "num": 10466, "desc": "Reference manual missing description of restrict counters to Deck option" },
         { "num": 10446, "desc": "Removed more items deprecated for over a year"},
         { "num": 10445, "desc": "Improved browser launch support" },
         { "num": 10432, "desc": "Store the tile cache in %LOCALAPPDATA% instead of %APPDATA% on Windows" },
         { "num": 10430, "desc": "Upgrade to Java 17 for Windows, Mac packages" }
      ]
    },
    {
      "in": "3.6.0-beta2",
      "since": "3.6.0-beta1",
      "new_features": [
      ],
      "bug_fixes": [
        { "num": 10390, "desc": "NPE in GameModule.getProperty() after deleting the Map from the owning Map widget" },
        { "num": 10387, "desc": "'Centre on Opponents Moves' functionality should ignore movement by Invisible units" },
        { "num": 10386, "desc": "Audit Trail reporting is not reporting trait or piece information for Return to Deck trait when invalid Deck specified" },
        { "num": 10381, "desc": "Replaying a log step can cause Deck to become corrupted" },
        { "num": 10375, "desc": "NPE in EnumeratedPropertyPrompt.getNewValue()" },
        { "num": 10371, "desc": "Reset the Zone Editor title to match the Zone being edited" },
        { "num": 10359, "desc": "ClassCastException: DeckGlobalCommand cannot be cast to Auditable" },
        { "num": 10357, "desc": "Return To Deck Deck name can be lost when pre 3.6 module is edited using 3.6" },
        { "num": 10351, "desc": "Checkbox preference default value is ignored" },
        { "num": 10341, "desc": "Symbolic Dice Button tooltip is overwritten by description text" },
        { "num": 10226, "desc": "Force Game Piece Image names to be valid file names ending in .png" },
        { "num": 10095, "desc": "Definition of Player Sides - Retire/Switch Button image not showing in editor" }
      ],
      "other_improvements": [
        { "num": 10392, "desc": "HTTP requests for server status should follow redirects" },
        { "num": 10383, "desc": "Update all site URLs for new site and HTTPS" },
        { "num": 10337, "desc": "Bring Reference Manual up to date" }
      ]
    },
    {
      "in": "3.6.0-beta1",
      "since": "3.5.8",
      "new_features": [
        { "num": 10276, "desc": "Expose property if we're currently drawing Counter Detail Viewer" },
        { "num": 10273, "desc": "Mat Cargo can be set to detect mats way from their exact center" },
        { "num": 10248, "desc": "Invisible trait - Option to disable auto-report of moves" },
        { "num": 10075, "desc": "Scaling factors for Layers and Non-Rectangular" },
        { "num": 10066, "desc": "Mats & Cargo - Cargo pieces stay attached to Mat piece when moving." },
        { "num": 10034, "desc": "Added option to Mass Piece Loader to not create empty levels in layers when there is no matching image" },
        { "num": 10021, "desc": "Added sub-folders to group components under Module, Maps, Decks, At-Start Stacks, Prototypes and Global Properties folders" },
        { "num": 10002, "desc": "Add Hotkeys to hide and show map windows. Existing show/hide hotkey field is now always visible. Allow changes to hide/show Map button settings without needing Editor restart" },
        { "num": 10001, "desc": "Inventory window allows a hotkey for Refresh" },
        { "num": 9998, "desc": "Editor now has Drag and Drop support" },
        { "num": 9997, "desc": "Can duplicate and insert components in Editor, not just add to bottom" },
        { "num": 9988, "desc": "CountStack() added to beanshell to count pieces in current Stack" },
        { "num": 9987, "desc": "ReportState checkbox overrides Global Key Command suppression of individual reports" },
        { "num": 9979, "desc": "Add Deck Sort Key Command component to allow sorting of cards in a Deck by properties via menu or hotkey. Add Deck Send Key Command component to provide additional commands to send contents of one Deck to another via menu or hotkey." },
        { "num": 9973, "desc": "Deck supports configurable strings for Draw Multiple, Draw Specific, Face Up, Face Down" },
        { "num": 9972, "desc": "Ability to specify Return-to-Deck target as an expression" },
        { "num": 9917, "desc": "Global Options can be configured to let toolbar items on closed windows accept global hotkeys" },
        { "num": 9912, "desc": "Add Global property MapName_isVisible for each Map to allow checking if Map is currently open" },
        { "num": 9901, "desc": "Preference to reverse left-to-right order counters are shown in Mouseover Stack Viewer" },
        { "num": 9864, "desc": "Improved translation features (Global Translatable Message component, Translatable Message trait, exposing current language/locale as property)" },
        { "num": 9549, "desc": "Default UI font size can be overridden in preferences" },
        { "num": 4542, "desc": "Added 'Stack Normally' option to 'Does Not Stack' trait" },
        { "num": 4533, "desc": "Make grid center dot display independent of grid display" }
      ],
      "bug_fixes": [
        { "num": 10326, "desc": "Add option to disable OpenGL FBOs on Macs" },
        { "num": 10301, "desc": "Double max heap and retry when image tiler runs out of memory" },
        { "num": 10294, "desc": "Can Rotate traits no longer lose any pre-defined starting rotation when editing a Piece Slot" },
        { "num": 10187, "desc": "Duplicate key and menu item for Editor menu" },
        { "num": 9993, "desc": "DeckPosition was reporting 1 higher than the actual position" },
        { "num": 9884, "desc": "Fix and improve module validity checking" },
        { "num": 6130, "desc": "Grid Numbering dialog can appear blank when grid size is very large" }
      ],
      "other_improvements": [
        { "num": 10286, "desc": "Add removal/deprecation checker and remove anything deprecated a year ago" },
        { "num": 10277, "desc": "When editing an IrregularGrid, start the map view somewhere near the grid or its parent Zone" },
        { "num": 10272, "desc": "Don't auto-name new regions a long string" },
        { "num": 10259, "desc": "64-bit ARM builds for Windows and Macs; switched bundled Java to Zulu" },
        { "num": 10228, "desc": "Upgrade to Launch4j 3.14" },
        { "num": 10041, "desc": "Newly added Layer traits will now default to 'Always active'" },
        { "num": 10015, "desc": "Remove ?s from checkbox preference strings" },
        { "num": 10011, "desc": "Add Scrollbars to Prefs Dialog when needed" },
        { "num": 9999, "desc": "First 'advanced search' on a module defaults to all boxes prechecked" },
        { "num": 9992, "desc": "Removed ignored 'button tooltip' field from Turn Tracker config" },
        { "num": 9989, "desc": "Less verbose window titles for sub-windows" },
        { "num": 9975, "desc": "Deck reports now suppressed during GKC report suppresssion" },
        { "num": 9913, "desc": "Increase number of default zoom levels in new Map Zoom Capability" },
        { "num": 9254, "desc": "Expression audit trails preference - Improve error reporting when Beanshell expressions fail. Suppress 'Bad Data in Module' errors generated by counters in Game Piece Palette." }
      ]
    }
  ]
}
