{
  "headline": "The VASSAL Team is happy to announce VASSAL {{version}}.",
  "important": [
    "NEW! 64-bit ARM packages: There are now MacOS and Windows packages for 64-bit ARM processors. If you have a Mac with an Apple Silicon CPU (which is a 64-bit ARM processor), we recommend using the 64-bit ARM build.",
    "Code deprecated more than a year ago has been removed. Modules containing custom code using that code MUST be updated if they are to work with {{version_feature}}.",
    "Things may be broken which worked previously. If you find a new bug, please report it.",
    "Modules saved in {{version_feature}} are not openable by earlier versions of VASSAL. We recommend keeping a backup copy of any pre-{{version_feature}} modules you plan to modify in {{version_feature}} until you've verified that everything works to your satisfaction."
  ],
  "downloads": [
    { "display_name": "Linux", "suffix": "linux.tar.bz2" },
    { "display_name": "MacOS (64-bit ARM)", "suffix": "macos-aarch64.dmg" },
    { "display_name": "MacOS (64-bit x86)", "suffix": "macos-x86_64.dmg" },
    { "display_name": "Windows (64-bit ARM)", "suffix": "windows-aarch64.exe" },
    { "display_name": "Windows (64-bit x86)", "suffix": "windows-x86_64.exe" },
    { "display_name": "Windows (32-bit x86)", "suffix": "windows-x86_32.exe" },
    { "display_name": "Other", "suffix": "other.zip" }
  ],
  "changes": [
    {
      "in": "3.6.12",
      "since": "3.6.11",
      "new_features": [
      ],
      "bug_fixes": [
        { "num": 11994, "desc": "Deck \"send-when-empty\" hotkeys no longer create extra undo steps" },
        { "num": 11993, "desc": "ActionButtons set to count 0 times don't spuriously execute 1 time" },
        { "num": 11982, "desc": "Fixed multiplayer problems with detach option on Deselect trait" },
        { "num": 11963, "desc": "SendToLocation, Can Rotate, and MoveFixedDistance were all unlinking from deck/stack at wrong time, causing buggy behavior in some instances especially involving decks" },
        { "num": 11961, "desc": "Clear up mark-when-moved problems for modules which still had a legacy value set" },
        { "num": 11884, "desc": "'OldMat' properties now set correctly regardless of order of Mat Cargo and Send-to-Location (etc.) traits" },
        { "num": 11880, "desc": "Triggers set to count 0 times don't spuriously execute 1 time" },
        { "num": 11714, "desc": "Deck's Send-when-Empty key now processes AFTER fully moving last card" },
        { "num": 11627, "desc": "ActionButtons with context menu flag no longer trigger context menu when a different ActionButton on same piece (that doesn't have the flag set) is clicked" },
        { "num": 11462, "desc": "Don't +1 inventory sum if property isn't even defined" },
        { "num": 11437, "desc": "Prevent NPE when right-clicking on a Deck with no menu items" },
        { "num": 11429, "desc": "Deck Empty Hotkey no longer repeats per online player instance, nor when stepping forward a log" }
      ],
      "other_improvements": [
        { "num": 12013, "desc": "Reinstate removal of module tile cache when a module is removed from the Module Manager" },
        { "num": 12007, "desc": "Update Apple Silicon terminology in preferences and docs" },
        { "num": 11986, "desc": "Add missing Section size symbol to NATO markers" },
        { "num": 11957, "desc": "Spaces in GKC reports made consistent with all other reports" },
        { "num": 11935, "desc": "Allow option for only first Mouseover-stack Viewer that generates a tooltip will be drawn" }
      ]
    },
    {
      "in": "3.6.11",
      "since": "3.6.10",
      "new_features": [
      ],
      "bug_fixes": [
        { "num": 11941, "desc": "Since 3.6.7, French/Belgian AZERTY keyboards on Mac were experiencing problems with Ctrl / Alt keys on the number key row" },
        { "num": 11938, "desc": "IndexOutOfBoundsException trying to open a private note" },
        { "num": 11933, "desc": "At-Start stacks were getting confused by blank boards" },
        { "num": 11929, "desc": "Show translated module name and descriptions in Module Manager" },
        { "num": 11924, "desc": "Reinstate translation of Player Sides" },
        { "num": 11904, "desc": "Global Key Command fastmatch for Mats fixed to avoid trait-order bugs" },
        { "num": 11901, "desc": "Corrected \"Mark When Moved\" documentation" },
        { "num": 11899, "desc": "Hide FileConfigurer label in preferences dialogs" },
        { "num": 11890, "desc": "NPE when current-stack option used on non-stacking piece" },
        { "num": 11505, "desc": "Insert items into formatted strings from drop-down list into the correctly selected position" }
      ],
      "other_improvements": [
        { "num": 11911, "desc": "Debug window shows board-relative coordinates if they are different from the map-relative ones" },
        { "num": 11906, "desc": "MatCargo's mat detection did unnecessary computations for lack of parentheses" },
        { "num": 11900, "desc": "Clear Tile Cache with more efficient Files.walkFileTree()" }
      ]
    }
  ]
}
