{
  "headline": "The VASSAL Team is happy to announce VASSAL {{version}}.",
  "important": [
    "NEW! 64-bit ARM packages: There are now MacOS and Windows packages for 64-bit ARM processors. If you have a Mac with an Apple Silicon CPU (which is a 64-bit ARM processor), we recommend using the 64-bit ARM build.",
    "Code deprecated more than a year ago has been removed. Modules containing custom code using that code MUST be updated if they are to work with {{version_feature}}.",
    "Things may be broken which worked previously. If you find a new bug, please report it.",
    "Modules saved in {{version_feature}} are not openable by earlier versions of VASSAL. We recommend keeping a backup copy of any pre-{{version_feature}} modules you plan to modify in {{version_feature}} until you've verified that everything works to your satisfaction."
  ],
  "downloads": [
    { "display_name": "Linux", "suffix": "linux.tar.bz2" },
    { "display_name": "MacOS (64-bit ARM)", "suffix": "macos-aarch64.dmg" },
    { "display_name": "MacOS (64-bit x86)", "suffix": "macos-x86_64.dmg" },
    { "display_name": "Windows (64-bit ARM)", "suffix": "windows-aarch64.exe" },
    { "display_name": "Windows (64-bit x86)", "suffix": "windows-x86_64.exe" },
    { "display_name": "Windows (32-bit x86)", "suffix": "windows-x86_32.exe" },
    { "display_name": "Other", "suffix": "other.zip" }
  ],
  "changes": [
    {
      "in": "3.6.16",
      "since": "3.6.15",
      "new_features": [
      ],
      "bug_fixes": [
        { "num": 12221, "desc": "Fixed various missing searchability on various components" },
        { "num": 12209, "desc": "Report correct trait in expression Audit Trail" },
        { "num": 12159, "desc": "Correctly handle install paths containing spaces in VASSAL.sh" },
        { "num": 12158, "desc": "List Key Commands tool can be re-opened after closing with X button" },
        { "num": 12152, "desc": "Work around Java bug which prevents displaying Windows file dialogs" }
      ],
      "other_improvements": [
      ]
    },
    {
      "in": "3.6.15",
      "since": "3.6.14",
      "new_features": [
      ],
      "bug_fixes": [
        { "num": 12119, "desc": "Restore vanished Load Comments" },
        { "num": 12116, "desc": "Pieces shouldn't receive same GKC twice just because it sent them to a new map" },
        { "num": 12105, "desc": "Deck's 'Send-to-Deck' subcomponent has access to properties (e.g., PlayerSide) and properly shuffles \"always shuffle\" decks" },
        { "num": 12093, "desc": "Fix disabling of toolbar items nested in multiple Toolbar Menus" }
      ],
      "other_improvements": [
        { "num": 12140, "desc": "Action Buttons on pieces that have just been drag-moved are suppressed for a half second for user-error avoidance" },
        { "num": 12085, "desc": "Screen capture default icon height adjusted to match the other 16-pixel-high icons" },
        { "num": 12069, "desc": "Tiling: Improved detection of and recovery from running out of memory; improved error dialogs" },
        { "num": 9894, "desc": "Improved error dialog for failure to start child process" }
      ]
    }
  ]
}
